dakhnod/NRF51-serial-multitool/main.c
#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_conn_params.h"
#include "softdevice_handler.h"
#include "app_timer_appsh.h"
#include "app_scheduler.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "boards.h"
#include "nrf_drv_spi.h"
#include "fds.h"
#include "nrf_gpio.h"
#include "nrf_drv_gpiote.h"
#include "nrf_drv_uart.h"
#include "nrf_uart.h"
#include "math.h"
#include "battery.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_delay.h"

#ifdef USE_DFU
#include "fstorage.h"
#include "ble_dfu.h"
#endif

#define IS_SRVC_CHANGED_CHARACT_PRESENT 0 /**< Include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device. */

#if (NRF_SD_BLE_API_VERSION == 3)
#define NRF_BLE_MAX_MTU_SIZE GATT_MTU_SIZE_DEFAULT /**< MTU size used in the softdevice enabling and to reply to a BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST event. */
#endif

#define APP_FEATURE_NOT_SUPPORTED BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2 /**< Reply when unsupported features are requested. */

#define CENTRAL_LINK_COUNT 0    /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT 1 /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define DEVICE_NAME "Serial adapter"                          /**< Name of device. Will be included in the advertising data. */
#define NUS_SERVICE_UUID_TYPE BLE_UUID_TYPE_VENDOR_BEGIN /**< UUID type for the Nordic UART Service (vendor specific). */


#define APP_TIMER_PRESCALER 0     /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE 4 /**< Size of timer operation queues. */

#define MIN_CONN_INTERVAL MSEC_TO_UNITS(100, UNIT_1_25_MS)                         /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL MSEC_TO_UNITS(200, UNIT_1_25_MS)                         /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY 0                                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT MSEC_TO_UNITS(1000, UNIT_10_MS)                          /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY APP_TIMER_TICKS(2000, APP_TIMER_PRESCALER) /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT 3                                            /**< Number of attempts before giving up the connection parameter negotiation. */

#define APP_ADV_INTERVAL_FAST           MSEC_TO_UNITS(1000, UNIT_0_625_MS)	    /**< The advertising interval (in units of 0.625 ms; this value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS 0 /**< The advertising timeout (in units of seconds). */

#define DEAD_BEEF 0xDEADBEEF /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define UART_TX_BUF_SIZE 512 /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE 512 /**< UART RX buffer size. */

static ble_nus_t m_nus;                                  /**< Structure to identify the Nordic UART Service. */
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */

#ifdef USE_DFU
ble_dfu_t dfu;
#endif

#ifdef USE_SPI
#define SPI_INSTANCE  0 /**< SPI instance index. */
static const nrf_drv_spi_t spi_instance = NRF_DRV_SPI_INSTANCE(SPI_INSTANCE);
#endif

#define FILE_SETTINGS 0x0001
#define RECORD_NAME   0x0001

#define TRIGGER_PIN_IN 6
#define TRIGGER_PIN_OUT 8
#define TRIGGER_DURATION 10000
#define TRIGGER_POLARITY_IN 0
#define TRIGGER_POLARITY_OUT 0
#define TRIGGER_PULL_IN NRF_GPIO_PIN_NOPULL
#define TRIGGER_UART_DELAY 500

APP_TIMER_DEF(uart_send_timer);

#ifdef TRIGGER_PIN_IN

#ifndef TRIGGER_DURATION
#error Please define TRIGGER_DURATION
#endif
#ifndef TRIGGER_POLARITY_IN
#error Please define TRIGGER_POLARITY_IN
#endif
#ifndef TRIGGER_POLARITY_OUT
#error Please define TRIGGER_POLARITY_OUT
#endif

APP_TIMER_DEF(trigger_timer);
#endif

bool uart_received_flag = false;

static nrf_drv_uart_t app_uart_inst = NRF_DRV_UART_INSTANCE(APP_UART_DRIVER_INSTANCE);
bool uart_enabled = true;

void uart_enable_set(bool);


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info)
{
    // On assert, the system can only recover with a reset.
  unsigned int tmp = id;
  NRF_LOG_ERROR("app_error_print():\r\n");
  NRF_LOG_ERROR("Fault identifier:  0x%X\r\n", tmp);
  NRF_LOG_ERROR("Program counter:   0x%X\r\n", tmp = pc);
  NRF_LOG_ERROR("Fault information: 0x%X\r\n", tmp = info);

  switch (id) {
    case NRF_FAULT_ID_SDK_ASSERT:
      NRF_LOG_ERROR("Line Number: %u\r\n", tmp =
        ((assert_info_t *)(info))->line_num);
      NRF_LOG_ERROR("File Name:   %s\r\n",
        (uint32_t)((assert_info_t *)(info))->p_file_name);
      break;

    case NRF_FAULT_ID_SDK_ERROR:
      NRF_LOG_ERROR("Line Number: %u\r\n", tmp =
        ((error_info_t *)(info))->line_num);
      NRF_LOG_ERROR("File Name:   %s\r\n",
        (uint32_t)((error_info_t *)(info))->p_file_name);
      NRF_LOG_ERROR("Error Code:  0x%X\r\n", tmp =
        ((error_info_t *)(info))->err_code);
      NRF_LOG_ERROR("Error description: %s\n", (uint32_t)ERR_TO_STR(((error_info_t *)(info))->err_code));
      break;
  }
#ifdef DEBUG
  for (;;);
#endif
}

