dakhnod/NRF51-serial-multitool/main.c
/**@brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize SoftDevice.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    ble_enable_params.common_enable_params.vs_uuid_count = 2;
    APP_ERROR_CHECK(err_code);

    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT, PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
    ble_enable_params.gatt_enable_params.att_mtu = NRF_BLE_MAX_MTU_SIZE;
#endif
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Subscribe for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}

void uart_send_timeout_handler()
{
    uint32_t err_code;
    uint32_t max_size = BLE_NUS_MAX_DATA_LEN;
    // max_size = 1;
    uint8_t current_byte;
    uint8_t data[max_size];
    uint32_t index = 0;
    while(true){
        NRF_LOG_DEBUG("reading next byte\n");
        uint32_t result = app_uart_get(&current_byte);
        if(result == NRF_ERROR_NOT_FOUND) break;
        data[index++] = current_byte;
        if(index == max_size) break;
    }
    NRF_LOG_DEBUG("sending %i bytes\n", index);
    if(index > 0){
        err_code = ble_nus_string_send(&m_nus, data, index);
        (void) err_code;
        // APP_ERROR_CHECK(err_code);
    }
}

/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' i.e '\r\n' (hex 0x0D) or if the string has reached a length of
 *          @ref NUS_MAX_DATA_LENGTH.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t *p_event)
{

    switch (p_event->evt_type)
    {
    case APP_UART_DATA_READY:

        app_timer_stop(uart_send_timer);
        app_timer_start(uart_send_timer, APP_TIMER_TICKS(10, APP_TIMER_PRESCALER), NULL);

        break;

    case APP_UART_COMMUNICATION_ERROR:
        NRF_LOG_ERROR("uart comm error: %d\n", p_event->data.error_communication);
        // APP_ERROR_HANDLER(p_event->data.error_communication);
        break;

    case APP_UART_FIFO_ERROR:
        NRF_LOG_ERROR("uart fifo error: %d\n", p_event->data.error_code);
        APP_ERROR_HANDLER(p_event->data.error_code);
        break;

    default:
        NRF_LOG_ERROR("what\n");
        break;
    }
}
/**@snippet [Handling the data received over UART] */

/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
#ifdef USE_UART
static void uart_init(void)
{
    uint32_t err_code;
    const app_uart_comm_params_t comm_params =
        {
            7,
            5,
            RTS_PIN_NUMBER,
            CTS_PIN_NUMBER,
            APP_UART_FLOW_CONTROL_DISABLED,
            false,
            UART_BAUDRATE_BAUDRATE_Baud115200};

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_MID,
                       err_code);
    APP_ERROR_CHECK(err_code);

    nrf_delay_ms(100);

    // nrf_gpio_cfg_input(RX_PIN_NUMBER, NRF_GPIO_PIN_PULLDOWN);
}
#endif

#ifdef USE_SPI
static void spi_init(){
    uint32_t err_code;

    nrf_drv_spi_config_t  spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;

    spi_config.sck_pin = SPIM0_SCK_PIN;
    spi_config.mosi_pin = SPIM0_MOSI_PIN;

    err_code = nrf_drv_spi_init(
        &spi_instance,
        &spi_config,
        NULL
    );

    APP_ERROR_CHECK(err_code);
}
#endif

void uart_enable_set(bool enable){
    if(uart_enabled == enable){
        return;
    }
    NRF_LOG_DEBUG("setting uart to %d\n", enable);
    UNUSED_PARAMETER(app_uart_inst);
    if(enable){
        nrf_drv_uart_rx_enable(&app_uart_inst);
        nrf_uart_enable(app_uart_inst.reg.p_uart);
        uart_enabled = true;
    }else{
        nrf_drv_uart_rx_disable(&app_uart_inst);
        nrf_uart_disable(app_uart_inst.reg.p_uart);
        uart_enabled = false;
    }
}

void trigger_timeout_handler(){
    nrf_gpio_pin_write(TRIGGER_PIN_OUT, !TRIGGER_POLARITY_OUT);

    uart_enable_set(false);
}

void gpio_trigger_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action){
    action -= 1;
    app_timer_stop(trigger_timer);
    if(action != TRIGGER_POLARITY_IN){
        uart_enable_set(true);
        nrf_gpio_pin_write(TRIGGER_PIN_OUT, TRIGGER_POLARITY_OUT);
    }else{
        app_timer_start(trigger_timer, APP_TIMER_TICKS(TRIGGER_DURATION, APP_TIMER_PRESCALER), NULL);
    }
}

void gpio_init(){
    ret_code_t err_code;

    err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_out_config_t out_config = GPIOTE_CONFIG_OUT_SIMPLE(false);
    err_code = nrf_drv_gpiote_out_init(TRIGGER_PIN_OUT, &out_config);
    APP_ERROR_CHECK(err_code);

    nrf_gpio_pin_write(TRIGGER_PIN_OUT, !TRIGGER_POLARITY_OUT);

    nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_TOGGLE(false);

    in_config.pull = TRIGGER_PULL_IN;

    err_code = nrf_drv_gpiote_in_init(TRIGGER_PIN_IN, &in_config, gpio_trigger_handler);
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_event_enable(TRIGGER_PIN_IN, true);
}

/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void
advertising_init ()
{
  uint32_t err_code;

  ble_advdata_t advdata = {
    .name_type = BLE_ADVDATA_FULL_NAME,
    .include_appearance = false,
    .flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE
  };

  ble_uuid_t m_adv_uuids[] = {
    {0xffe0, BLE_UUID_TYPE_BLE},
    {0x0001, BLE_UUID_TYPE_VENDOR_BEGIN + 1},
  }; /**< Universally unique service identifier. */

  // ble_uuid_t adv_uuids[] = {{LBS_UUID_SERVICE, m_lbs.uuid_type}};
  ble_advdata_t scanrsp = {
    .uuids_complete.uuid_cnt = 2,
    .uuids_complete.p_uuids  = m_adv_uuids
  };

  // sd_ble_gap_appearance_set (BLE_APPEARANCE_GENERIC_THERMOMETER);

  err_code = ble_advdata_set (&advdata, &scanrsp);
  APP_ERROR_CHECK (err_code);
}

/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;

    (void)nus_data_handler;

    NRF_LOG_INIT(NULL);

    NRF_LOG_DEBUG("starting...\n");

    // Initialize.
    APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    err_code = app_timer_create(
        &uart_send_timer,
        APP_TIMER_MODE_SINGLE_SHOT,
        uart_send_timeout_handler);
    APP_ERROR_CHECK(err_code);

    #ifdef TRIGGER_PIN_IN
    err_code = app_timer_create(
        &trigger_timer,
        APP_TIMER_MODE_SINGLE_SHOT,
        trigger_timeout_handler);
    APP_ERROR_CHECK(err_code);

    gpio_init();
    #endif

    NRF_LOG_DEBUG("timer inited\n");
    #ifdef USE_UART
    uart_init();
    NRF_LOG_DEBUG("uart inited\n");
    #endif
    #ifdef USE_SPI
    spi_init();
    NRF_LOG_DEBUG("spi inited\n");
    #endif
    ble_stack_init();
    NRF_LOG_DEBUG("ble stack inited\n");
    filesystem_init();
    NRF_LOG_DEBUG("fds inited\n");
    gap_params_init();
    NRF_LOG_DEBUG("gap inited\n");
    services_init();
    NRF_LOG_DEBUG("services inited\n");
    advertising_init();
    NRF_LOG_DEBUG("advertising inited\n");
    conn_params_init();
    NRF_LOG_DEBUG("conn params inited\n");

    advertising_start(APP_ADV_INTERVAL_FAST);
    NRF_LOG_DEBUG("advertising started\n");

    #ifdef TRIGGER_PIN_IN
    uart_enable_set(false);
    #endif

    // Enter main loop.
    for (;;)
    {
        power_manage();
        app_sched_execute();
    }
}

/**
 * @}
 */
